{
  "reviews": [
    {
      "id": 1,
      "user_image": "https://randomuser.me/api/portraits/men/82.jpg",
      "name": "John Smith",
      "recipe": "Chocolate Cake",
      "recipe_image": "https://static.toiimg.com/thumb/53096885.cms?imgsize=1572013&width=800&height=800",
      "score": 4,
      "review": "I recently made this chocolate cake recipe and it turned out to be a real hit at my party! The cake was moist and rich, and the chocolate frosting was absolutely decadent. Everyone loved it and asked for seconds. The recipe was easy to follow, and I highly recommend it!"
    },
    {
      "id": 2,
      "user_image": "https://randomuser.me/api/portraits/women/0.jpg",
      "name": "Emily Johnson",
      "recipe": "Chicken Parmesan",
      "recipe_image": "https://assets.bonappetit.com/photos/5ea8f0df16738800085ad5d2/1:1/w_2560%2Cc_limit/Chicken-Parmesean-Recipe-Lede.jpg",
      "score": 4,
      "review": "I tried this chicken Parmesan recipe last night and it was fantastic! The chicken was perfectly cooked and juicy, and the tomato sauce had just the right amount of tanginess. The melted cheese on top added a great flavor. It took a bit of time to prepare, but the end result was definitely worth it."
    },
    {
      "id": 3,
      "name": "Michael Brown",
      "user_image": "https://randomuser.me/api/portraits/men/76.jpg",
      "recipe": "Spaghetti Carbonara",
      "recipe_image": "https://static01.nyt.com/images/2021/02/14/dining/carbonara-horizontal/carbonara-horizontal-threeByTwoMediumAt2X-v2.jpg",
      "score": 5,
      "review": "This spaghetti carbonara recipe is hands down the best I've ever tried. The combination of crispy bacon, creamy sauce, and perfectly cooked pasta is simply divine. The recipe instructions were clear, and I had no trouble making it. I highly recommend giving this recipe a try!"
    },
    {
      "id": 4,
      "name": "Sarah Davis",
      "user_image": "https://randomuser.me/api/portraits/women/27.jpg",
      "recipe": "Banana Bread",
      "recipe_image": "https://www.simplyrecipes.com/thmb/tR-5eHAZ3lgNR6Yvu3yxdHMNpk8=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/Simply-Recipes-Easy-Banana-Bread-LEAD-2-2-63dd39af009945d58f5bf4c2ae8d6070.jpg",
      "score": 4,
      "review": "I made this banana bread recipe yesterday, and it was a big hit with my family. The bread turned out moist and flavorful, with a lovely aroma filling the house. It was a breeze to make, and the bananas added a natural sweetness. I'll definitely be making this recipe again!"
    },
    {
      "id": 5,
      "name": "David Wilson",
      "user_image": "https://randomuser.me/api/portraits/men/53.jpg",
      "recipe": "Beef Stir-Fry",
      "recipe_image": "https://thecozycook.com/wp-content/uploads/2022/07/Ground-Beef-Stir-Fry-f.jpg",
      "score": 3,
      "review": "I tried this beef stir-fry recipe for dinner last week, and it was just okay. The flavors were decent, but I found the meat to be a bit tough. The vegetables were cooked well, though. Overall, it was an average dish, but I'm not sure if I'd make it again."
    },
    {
      "id": 6,
      "name": "Olivia Martinez",
      "user_image": "https://randomuser.me/api/portraits/women/26.jpg",
      "recipe": "Pumpkin Soup",
      "recipe_image": "https://media.healthyfood.com/wp-content/uploads/2019/07/Creamy-pumpkin-soup-1024x638.jpg",
      "score": 5,
      "review": "I made this pumpkin soup recipe for a cozy fall dinner, and it was absolutely delicious! The soup had a creamy and velvety texture, with a perfect balance of spices. The recipe was straightforward, and I appreciated the helpful tips provided. It's a definite keeper!"
    },
    {
      "id": 7,
      "name": "Daniel Thompson",
      "user_image": "https://randomuser.me/api/portraits/men/41.jpg",
      "recipe": "Mushroom Risotto",
      "recipe_image": "https://cupfulofkale.com/wp-content/uploads/2020/05/Creamy-Vegan-Wild-Mushroom-Risotto-720x720.jpg",
      "score": 4,
      "review": "I love mushroom risotto, and this recipe did not disappoint. The risotto turned out creamy and flavorful, and the mushrooms added a nice earthy touch. It took some patience and stirring to get the right consistency, but the end result was worth it. I'll be making this again for sure!"
    },
    {
      "id": 8,
      "name": "Sophia Lee",
      "user_image": "https://randomuser.me/api/portraits/women/56.jpg",
      "recipe": "Lemon Bars",
      "recipe_image": "https://simply-delicious-food.com/wp-content/uploads/2020/07/Easy-zesty-lemon-bars-4.jpg",
      "score": 4,
      "review": "I made these lemon bars for a family gathering, and they were a hit! The crust was buttery and crisp, while the lemon filling was tangy and perfectly balanced with sweetness. They were easy to make, and the recipe instructions were clear. I received many compliments, and I'll definitely be making these again."
    },
    {
      "id": 9,
      "name": "Lily Thompson",
      "user_image": "https://randomuser.me/api/portraits/women/41.jpg",
      "recipe": "Apple Pie",
      "recipe_image": "https://www.recipetineats.com/wp-content/uploads/2022/11/Apple-Pie_8.jpg",
      "score": 5,
      "review": "I recently made this apple pie recipe for a family gathering, and it was a huge success! The crust was flaky and golden, while the apple filling was perfectly spiced and had a nice balance of sweetness and tartness. The recipe instructions were clear and easy to follow, resulting in a pie that looked and tasted amazing. It was the perfect dessert for the occasion, and everyone loved it. I highly recommend giving this recipe a try!"
    },

    {
      "id": 10,
      "name": "Ava Carter",
      "user_image": "https://randomuser.me/api/portraits/women/17.jpg",
      "recipe": "Shrimp Scampi",
      "recipe_image": "https://bakerbynature.com/wp-content/uploads/2023/02/shrimp-scampi-119.jpg",
      "score": 3,
      "review": "I tried this shrimp scampi recipe last night, and it was okay. The garlic and lemon flavors were nice, but I found the sauce to be a bit too buttery for my taste. The shrimp cooked well and had a good texture. It was a decent dish overall, but I may modify the recipe next time."
    },
    {
      "id": 11,
      "name": "Ethan Turner",
      "user_image": "https://randomuser.me/api/portraits/men/2.jpg",
      "recipe": "Homemade Pizza",
      "recipe_image": "https://images-gmi-pmc.edge-generalmills.com/53d1a753-2946-4c23-b62d-2166bfbeb068.jpg",
      "score": 5,
      "review": "I absolutely loved this homemade pizza recipe! The dough was easy to work with and resulted in a perfectly crispy crust. The sauce had a great depth of flavor, and the combination of toppings was delightful. It was as good as or even better than many pizzeria pizzas I've tried. Highly recommended!"
    },
    {
      "id": 12,
      "name": "Emma Anderson",
      "user_image": "https://randomuser.me/api/portraits/women/19.jpg",
      "recipe": "Beef Chili",
      "recipe_image": "https://www.thewholesomedish.com/wp-content/uploads/2018/05/The-Best-Classic-Chili-550.jpg",
      "score": 4,
      "review": "I made this beef chili recipe for a chilly winter evening, and it warmed us right up! The meat was tender, and the blend of spices gave the chili a robust flavor. It had just the right amount of heat for my taste. I served it with some cornbread, and it was a hearty and satisfying meal."
    },
    {
      "id": 13,
      "name": "Noah Walker",
      "user_image": "https://randomuser.me/api/portraits/men/54.jpg",
      "recipe": "Blueberry Muffins",
      "recipe_image": "https://www.allrecipes.com/thmb/7JM6ev8saEJ8zh2lg_t3hjDv_wM=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/662790-42748a55c35047ba93ce1186d97f2e6c.jpg",
      "score": 5,
      "review": "I tried this blueberry muffin recipe for breakfast, and they were fantastic! The muffins were moist and packed with juicy blueberries. The crumb topping added a nice texture and sweetness. They were quick to make, and the recipe yielded a perfect batch. I'll be making these again soon."
    },
    {
      "id": 14,
      "name": "Isabella King",
      "user_image": "https://randomuser.me/api/portraits/women/30.jpg",
      "recipe": "Oatmeal Cookies",
      "recipe_image": "https://www.allrecipes.com/thmb/rs48bDYw9CV2na5vcbcL65plGgQ=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/3779973_original-c127ae994d5d4ffd89520a7a0b737419.jpg",
      "score": 3,
      "review": "I made these oatmeal cookies for a bake sale, and they were decent. The cookies had a good texture, but I found them to be a bit too sweet for my liking. The recipe was easy to follow, and they turned out well, but I might reduce the sugar next time."
    }
  ]
}
